
def area(a):
    """
    Вычисляет площадь квадрата.

        Параметры:
            a (float): сторона квадрата

        Возвращаемое значение:
            float: площадь квадрата

        Пример:
            >>> area(7)
            49
    """
    return a * a


def perimeter(a):
    """
    Вычисляет периметр квадрата.

        Параметры:
            a (float): сторона квадрата

        Возвращаемое значение:
            float: периметр квадрата

        Пример:
            >>> perimeter(7)
            28
    """
    return 4 * a
